---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleLinearUnits
source: html/f1e6122a-be9a-34c5-537f-300ebc6f5a43.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleLinearUnits Property

"Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleLinearUnits { get; }
```